{
    "name": "The Basics",
    "icon": "minecraft:crafting_table",
    "category": "patchouli:000-welcome",
    "pages": [
        {
            "type": "patchouli:text",
            "title": "Basics of the modpack",
            "text": "If you are playing this modpack it's safe to assume you already know the basics of minecraft so let's get to the point.$(br)As you already noticed you already had this book in your inventory, you can also craft it if you loose it, the same applies for the quest book.$(br)When you open your inventory you will see the recipe book has disappeard but don't worry there is a mod to show you all the recipes, check the right side of your screen when you open your inventory. "
        },
        {
            "type": "patchouli:image",
            "title": "JEI",
            "text": "This is JUST ENOUGH ITEMS or 'JEI' for short, when you click on any item you will see the recipe for the item, when you do it in a crafting table or any compatible table you will see a '+' icon to move your items to the table.",
            "images": [
                "se5:books/guide/welcome/jei"
            ]
        },
        {
            "type": "patchouli:text",
            "title": "QoL Tweaks",
            "text": "We included some quality of life tweaks to help you in your journey, you can hold your mouse button and drag it throogh item slots to move them to the container you are acessing or from the container, you can also right click on crops to harvest."
        },
        {
            "type": "patchouli:text",
            "title": "Settings",
            "text":  "We added some mods to make your game run better and the mods added some options you can configure, explore the graphics settings to adjust your graphics, and don't forget to check your keybinds."
        },
        {
            "type": "patchouli:text",
            "title": "Quests",
            "text": "We think this should be obious but to check your quests open your quest book."
        },
        {
            "type": "patchouli:text",
            "title": "Mods",
            "text": "If you never player with mods, or maybe you already have some experience this is what you need to know:$(br)Every mod add it's own content and thanks to the way the mods are made some of them already integrate with each other but not at the same way we would like so we have integrate them 'better' so let's review the basics of this modpack."
        },
        {
            "type": "patchouli:text",
            "title": "Custom Items",
            "text": "We made some custom items to help us integrate mods and to add end-game items we could add with a mod but would be harder to maintain a mod for all diffrent game versions but creating items in the modpack itself is easier because we don't need that many changes on our code."
        },
        {
            "type": "patchouli:text",
            "title": "Custom Item - Part 2",
            "text": "We also made a currency to be used between players in the same server/world and in some other things we are planning to add. We made converting ores easy with the Transmutation Stone, our creation inspired on a mod called 'ProjectE', this item is just needed to convert ores and can be useful to save some time."
        },
        {
            "type": "patchouli:text",
            "title": "Custom Ores",
            "text": "We made some custom ores to follow the game default's way to add a material for armor and tools, on previous modpacks we used to make a crafting for that but we decided to make it a little more like it's parte of the game..."
        },
        {
            "type": "patchouli:text",
            "title": "Custom Recipes",
            "text": "We made a lot of custom recipes to balance the modpack, to integrate mods into each other and to make some recipes make more sense. You can check our custom recipes the same way you can check the other recipes on JEI and we already explaind you how."
        }
    ]
}